# Restaurant Example (restaurant.json)
{
  "business_name": "Bella Vista Restaurant",
  "business_description": "An authentic Italian restaurant serving traditional recipes passed down through generations. We use fresh, locally-sourced ingredients to create memorable dining experiences in a warm, family-friendly atmosphere.",
  "services_list": "Fine Dining, Catering, Private Events, Takeaway, Wine Selection, Chef's Specials",
  "target_audience": "Food enthusiasts, families, couples, and professionals looking for quality Italian cuisine and memorable dining experiences",
  "color_theme": "warm",
  "tone_style": "friendly"
}

# Consulting Example (consulting.json)
{
  "business_name": "Strategic Business Solutions",
  "business_description": "A management consulting firm helping small and medium businesses optimize operations, increase profitability, and achieve sustainable growth through strategic planning and process improvement.",
  "services_list": "Business Strategy, Operations Consulting, Financial Planning, Process Improvement, Market Analysis, Change Management",
  "target_audience": "Small to medium business owners, entrepreneurs, and executives seeking to improve business performance and growth",
  "color_theme": "professional",
  "tone_style": "professional"
}

# Retail Example (retail.json)  
{
  "business_name": "Urban Style Boutique",
  "business_description": "A trendy fashion boutique offering curated collections of contemporary clothing, accessories, and lifestyle products for the modern, style-conscious individual.",
  "services_list": "Fashion Retail, Personal Styling, Online Shopping, Custom Alterations, Seasonal Collections, Gift Cards",
  "target_audience": "Fashion-forward millennials and Gen Z consumers aged 18-35 who value unique style and quality clothing",
  "color_theme": "playful",
  "tone_style": "modern"
}

# Healthcare Example (healthcare.json)
{
  "business_name": "Wellness First Medical Center",
  "business_description": "A comprehensive healthcare facility providing personalized medical care, preventive services, and wellness programs to help patients achieve optimal health and well-being.",
  "services_list": "Primary Care, Preventive Medicine, Health Screenings, Wellness Programs, Telemedicine, Specialist Referrals",
  "target_audience": "Individuals and families seeking comprehensive healthcare services, preventive care, and wellness support",
  "color_theme": "cool",
  "tone_style": "professional"
}

# Technology Example (technology.json)
{
  "business_name": "InnovateTech Solutions",
  "business_description": "A forward-thinking technology company specializing in custom software development, digital transformation, and innovative solutions that help businesses leverage technology for competitive advantage.",
  "services_list": "Custom Software Development, Web Applications, Mobile Apps, Cloud Solutions, Digital Transformation, Tech Consulting",
  "target_audience": "Small to medium businesses, startups, and entrepreneurs looking to leverage technology for growth and efficiency",
  "color_theme": "modern",
  "tone_style": "modern"
}